# StructuralSectionUtils Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionUtils Members
StructuralSectionUtils Class Methods See Also
---
The StructuralSectionUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetStructuralElementDefinitionData | Return structural element definition data. |
| GetStructuralSection | Return structural section from element. |
| SetStructuralSection | Set structural section in element. |

# See Also
StructuralSectionUtils Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace